'''
[ ACM 호텔 ]
ACM 호텔 매니저 지우는 손님이 도착하는 대로 빈 방을 배정하고 있다.
고객 설문조사에 따르면 손님들은 호텔 정문으로부터 걸어서 가장 짧은 거리에 있는 방을 선호한다고 한다.
여러분은 지우를 도와 줄 프로그램을 작성하고자 한다.
즉 설문조사 결과 대로 호텔 정문으로부터 걷는 거리가 가장 짧도록 방을 배정하는 프로그램을 작성하고자 한다.

문제를 단순화하기 위해서 호텔은 직사각형 모양이라고 가정하자.
각 층에 W 개의 방이 있는 H 층 건물이라고 가정하자 (1 ≤ H, W ≤ 99).
그리고 엘리베이터는 가장 왼쪽에 있다고 가정하자(그림 1 참고).
이런 형태의 호텔을 H × W 형태 호텔이라고 부른다.
호텔 정문은 일층 엘리베이터 바로 앞에 있는데,정문에서 엘리베이터까지의 거리는 무시한다.
또 모든 인접한 두 방 사이의 거리는 같은 거리(거리 1)라고 가정하고 호텔의 정면 쪽에만 방이 있다고 가정한다.



방 번호는 YXX 나 YYXX 형태인데 여기서 Y 나 YY 는 층 수를 나타내고 XX 는 엘리베이터에서부터 세었을 때의 번호를 나타낸다.
즉, 그림 1 에서 빗금으로 표시한 방은 305 호가 된다.
손님은 엘리베이터를 타고 이동하는 거리는 신경 쓰지 않는다.
다만 걷는 거리가 같을 때에는 아래층의 방을 더 선호한다.
예를 들면 102 호 방보다는 301 호 방을 더 선호하는데, 102 호는 거리 2 만큼 걸어야 하지만 301 호는 거리 1 만큼만 걸으면 되기 때문이다.
같은 이유로 102 호보다 2101 호를 더 선호한다.

여러분이 작성할 프로그램은 초기에 모든 방이 비어있다고 가정하에 이 정책에 따라
N 번째로 도착한 손님에게 배정될 방 번호를 계산하는 프로그램이다.
첫 번째 손님은 101 호, 두 번째 손님은 201 호 등과 같이 배정한다.

입력 예제)
2            -> TestCase
6 12 10      -> h, w, n
30 50 72

출력 예제)
402
1203

'''

'''
[ 접근방법 ]
문제 설명이 복잡해 보이지만 결국 n번째 손님이 묵는 방을 구하는 것이다. 규칙으로 인해 항상 1층부터 h층까지 순차적으로 1번방이
채워지고, 다시 1층의 2번방부터 h층의 2번방... 1층의 w방부터 h층의 w방까지 손님을 채우게 된다.

n을 h로 나눈 몫과 나머지를 이용하여 구했는데 하다보니 제약사항이 생겼다.
바로 h층이다. 항상 h층은 n // h 했을 때 나머지가 발생하지 않아 0층이 되어버린다. 그래서 if문을 통해 보정했다.

문제 자체는 어렵지 않았으나 제약사항을 발견하는데 오랜 시간이 걸렸다. 하필 채점프로그램의 첫 TestCase가 마지막층을 답으로 내는
문제인지 채점을 시작하자마자 '틀렸습니다'가 출력되 다소 당황했다. 99 x 99 의 모든 경우를 전수조사해서 코드를 수정했다.

추가로 처음에는 1~9호는 앞에 문자 '0'을 붙이는 코딩을 했다가, 다른 사람의 코드를 보고 그냥 floor에 100을 곱해서 단위를 조절하는
방법으로 코드를 수정했다.
'''


def ACM_Hotel(h, w, n):
    no, floor = divmod(n, h)
    if floor == 0:
        floor = h
    else:
        no += 1
    return floor * 100 + no

# test case    
for t in range(int(input())):
    h, w, n = map(int, input().split())
    print(int(ACM_Hotel(h, w, n)))
